pages/2_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Computational Thinking</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="X Ellis" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Computational Thinking</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/digixc/8-CS-ProblemSolving">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="underlay" onclick="underlayoff()">
</div>
<div id="overlay" onclick="overlayoff()">
</div>
<div id=overlayMenu>
<p onclick="overlayon('hsla(0, 0%, 50%, 0.5)')">Grey overlay</p>
<p onclick="underlayon('hsla(300,100%,50%, 0.3)')">Pink</p>
<p onclick="underlayon('hsla(80, 90%, 40%, 0.4)')">Green</p>
<p onclick="underlayon('hsla(240,100%,50%,0.2)')">Blue</p>
<p onclick="underlayon('hsla(40,100%,50%,0.3)')">Cream</p>
<p onclick="underlayon('hsla(300,100%,40%,0.3)')">Liliac</p>
<p onclick="underlayon('hsla(300,100%,25%,0.3)')">Purple</p>
<p onclick="underlayon('hsla(60,100%,50%,0.3)')">Yellow</p>
</div>
<div id="outline-container-sec-1" class="outline-2 objectives">
<h2 id="sec-1"><span class="section-number-2">1</span> Objectives</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Developing <b>Algorithms</b> learning strand, specifically:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>be able to understand and articulate a given problem
</li>
<li>be able to develop algorithms for given problems
</li>
<li>understand that algorithms are implemented on digital devices as programs. 
</li>
<li>design simple algorithms using loops (repetition), and selection (if statement)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2"><span class="section-number-2">2</span> Computational Thinking</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3 learn">
<h3 id="sec-2-1">Learn It</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Lets recap:
<ul class="org-ul">
<li><b>Computational thinking</b> is the thought processes of understanding a problem and presenting its solution(s) in such a way that a computer or human can understand and a computer can effectively carry out.
</li>
</ul>
</li>
<li>Lets break down the concept above:
<ol class="org-ol">
<li>understanding the problem
</li>
<li>presenting the solutions so a computer or human can understand
</li>
<li>a computer can carry out solving the problem based on the solutions presented to it
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3 try">
<h3 id="sec-2-2">Try It</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Lets consider the following sequence of numbers.  The problem to be solved is to find the largest number:
</li>
</ul>
<pre class="example">
10 12 8 9 6 15 20 14
</pre>
<p>
<code>Step 1</code>: understanding the problem.  This is very important step.  We need to know what exactly the problem is.  In this case, 
</p>
<ul class="org-ul">
<li>to find the largest number from the given sequence
</li>
</ul>

<p>
<code>Step 2</code>:  presenting the solution so a computer or human can understand. 
</p>
<ol class="org-ol">
<li>What does it mean by <b>presenting the problem</b>?   
<ul class="org-ul">
<li>This means describing the problem in some fashion. For a human to understand, we can use text or diagram. 
</li>
<li>The following is a solution to the finding the largest number problem described in plain but structured English:
<pre class="example">
1  Start from the first number in the list
2       
3  if the first number is larger or equal to the next number
4      make the first number the largest number
5  else
6      make the next number the largest number
7  Move to the next number
8  Repeat the steps 3 to 7 until all the number in the list is compared
</pre>
</li>
</ul>
<p>
<b>But</b>
</p>
</li>
<li>How to present the solution so a computer can understand? This is where computer programming languages come to play.
</li>
<li>Humans use programming languages to present/describe the solution to a computer. This is called <code>implementation of the solution</code> in programming language.
<ol class="org-ol">
<li>The following is the implemented solution using Python.
</li>
</ol>
</li>
</ol>


<p>
<code>Step 3</code>: Computers follow the instructions from the solution presented to carry out solving the problem. Run the program below and see if the solution works.  
</p>
<iframe src="https://trinket.io/embed/python/f99d6c2127" width="100%" height="400" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2 activity">
<h2 id="sec-3"><span class="section-number-2">3</span> Algorithmic Thinking in Computational Thinking</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-sec-3-1" class="outline-3 learn">
<h3 id="sec-3-1">Learn It</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>In the previous finding the largest number problem, we have learned 3 equally important aspects of problem solving in computing:
<ol class="org-ol">
<li>understanding the problem
</li>
<li>describeing/presenting the solution so a human or a computer can understand
</li>
<li>implementing the problem using programming language
</li>
</ol>
</li>

<li>Lets focus on the step 2: describe/present the solution so a computer/human can understand. We did this by using a sequence of text or plain English but with some structure to make the solution easier for a human to follow.
</li>
<li>A solution given in step by step instructions is called an <b>algorithm</b>. 
</li>
<li><b>Algorithmic thinking</b> is to have a solution to a problem, and the solution is such that it can be described in a sequence of instructions.
</li>
<li>If we have an algorithm, then we can write a program to do it.
</li>
<li>Computer programs are just algorithms written out in a programming language so computers can understand.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3 try">
<h3 id="sec-3-2">Try It</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Now, lets apply <b>computational thinking</b> to a simple problem and try to work out step by step.
<pre class="example">
Given a sequence of numbers: 45 67 -9 12 -92 -10 44
Find all positive numbers in the given sequence
</pre>
</li>
<li>Try to work out the following by yourself:
<ol class="org-ol">
<li>understanding the problem.
</li>
<li>using <b>algorithmic thinking</b>, and plain but structured English to present a solution to the given problem so your peers can understand.
</li>
<li>try to implement the solution you created in step 2 in Python. To implement it, you need:
<ul class="org-ul">
<li><a href="../../CS-PythonKeySkills/pages/PythonkeySkills.html#sec-1-3">create a list</a> to hold the numbers
</li>
<li>use a loop (<a href="../../CS-PythonKeySkills/pages/PythonkeySkills2.html#sec-1-1">for or while loop</a>) to go through the list
</li>
<li>use <a href="../../CS-PythonKeySkills/pages/PythonkeySkills.html#sec-1-2">if statement</a> to decide if a number is positive or not 
</li>
</ul>
</li>
<li>run the Python program to see if it works.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3 silver">
<h3 id="sec-3-3">Badge It - Silver</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">learning strand: <b>Algorithms</b></h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>Upload your written understanding of the above given problem in plain English to www.bournetolearn.com. Your work must include your understanding of positive numbers.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3 gold">
<h3 id="sec-3-4">Badge It - Gold</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1">learning strand: <b>Algorithms</b></h4>
<div class="outline-text-4" id="text-3-4-1">
<ul class="org-ul">
<li>Your solution (algorithm) to the problem above in structured English. Upload your work to www.bournetolearn.com. 
</li>
<li>Your algorithm should meet the criteria that it can be understood by a human or for a human to follow to find all positive numbers in a list.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3 platinum">
<h3 id="sec-3-5">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1">learning strand: <b>Algorithms</b></h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>Screenshot of your implemented working solution in Python and upload to www.bournetolearn.com
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
